# Порівняйте ефективність алгоритмів пошуку підрядка: Боєра-Мура, Кнута-Морріса-Пратта 
# та Рабіна-Карпа на основі двох текстових файлів (стаття 1, стаття 2). Використовуючи timeit, 
# треба виміряти час виконання кожного алгоритму для двох видів підрядків: одного, 
# що дійсно існує в тексті, та іншого — вигаданого (вибір підрядків за вашим бажанням). 
# На основі отриманих даних визначте найшвидший алгоритм для кожного тексту окремо та в цілому.

# Програмно реалізовано алгоритми пошуку підрядка: Боєра-Мура, Кнута-Морріса-Пратта та Рабіна-Карпа.
# На основі виконання кожного з трьох алгоритмів визначено найшвидший алгоритм для кожного з двох текстів.
# Зроблено висновки щодо швидкостей алгоритмів для кожного тексту окремо та в цілому. 
# Висновки оформлено у вигляді документа формату markdown.