# Реалізуйте двійковий пошук для відсортованого масиву з дробовими числами. Написана функція 
# для двійкового пошуку повинна повертати кортеж, де першим елементом є кількість ітерацій, 
# потрібних для знаходження елемента. Другим елементом має бути "верхня межа" — це найменший елемент, 
# який є більшим або рівним заданому значенню.

# Виконання коду повертає кортеж, де першим елементом є кількість ітерацій, потрібних 
# для знаходження елемента. Другим елементом є "верхня межа" (найменший елемент, який є більшим 
# або рівним заданому значенню).
